{"weightsManifest": [{"paths": ["group1-shard1of57.lbin", "group1-shard2of57.lbin", "group1-shard3of57.lbin", "group1-shard4of57.lbin", "group1-shard5of57.lbin", "group1-shard6of57.lbin", "group1-shard7of57.lbin", "group1-shard8of57.lbin", "group1-shard9of57.lbin", "group1-shard10of57.lbin", "group1-shard11of57.lbin", "group1-shard12of57.lbin", "group1-shard13of57.lbin", "group1-shard14of57.lbin", "group1-shard15of57.lbin", "group1-shard16of57.lbin", "group1-shard17of57.lbin", "group1-shard18of57.lbin", "group1-shard19of57.lbin", "group1-shard20of57.lbin", "group1-shard21of57.lbin", "group1-shard22of57.lbin", "group1-shard23of57.lbin", "group1-shard24of57.lbin", "group1-shard25of57.lbin", "group1-shard26of57.lbin", "group1-shard27of57.lbin", "group1-shard28of57.lbin", "group1-shard29of57.lbin", "group1-shard30of57.lbin", "group1-shard31of57.lbin", "group1-shard32of57.lbin", "group1-shard33of57.lbin", "group1-shard34of57.lbin", "group1-shard35of57.lbin", "group1-shard36of57.lbin", "group1-shard37of57.lbin", "group1-shard38of57.lbin", "group1-shard39of57.lbin", "group1-shard40of57.lbin", "group1-shard41of57.lbin", "group1-shard42of57.lbin", "group1-shard43of57.lbin", "group1-shard44of57.lbin", "group1-shard45of57.lbin", "group1-shard46of57.lbin", "group1-shard47of57.lbin", "group1-shard48of57.lbin", "group1-shard49of57.lbin", "group1-shard50of57.lbin", "group1-shard51of57.lbin", "group1-shard52of57.lbin", "group1-shard53of57.lbin", "group1-shard54of57.lbin", "group1-shard55of57.lbin", "group1-shard56of57.lbin", "group1-shard57of57.lbin"], "weights": [{"dtype": "float32", "shape": [365], "name": "dense/bias"}, {"dtype": "float32", "shape": [2048, 365], "name": "dense/kernel"}, {"dtype": "int32", "shape": [], "name": "Flatten/flatten/Reshape/shape/1"}, {"dtype": "int32", "shape": [1], "name": "Flatten/flatten/strided_slice/stack_1"}, {"dtype": "int32", "shape": [1], "name": "Flatten/flatten/strided_slice/stack"}, {"dtype": "float32", "shape": [1, 1, 1, 2048], "name": "bn5a_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5a_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5a_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5a_branch2b/merged_input"}, {"dtype": "int32", "shape": [4, 2], "name": "Pad_1/paddings"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5a_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 512], "name": "res5a_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4a_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4a_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4a_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4a_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4a_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 256], "name": "res4a_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3a_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3a_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3a_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3a_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3a_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "name": "res3a_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn2a_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2a_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2a_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2a_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "name": "res2a_branch2a/merged_input"}, {"dtype": "float32", "shape": [], "name": "PadV2/constant_values"}, {"dtype": "int32", "shape": [4, 2], "name": "PadV2/paddings"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn_conv1/sub"}, {"dtype": "float32", "shape": [7, 7, 3, 64], "name": "conv1/merged_input"}, {"dtype": "int32", "shape": [4, 2], "name": "Pad/paddings"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn2a_branch1/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2a_branch1/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn2b_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2b_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2b_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2b_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2b_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2b_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn2c_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "name": "res2c_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2c_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "res2c_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 64], "name": "bn2c_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "name": "res2c_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3a_branch1/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "name": "res3a_branch1/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b1_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b1_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b1_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b1_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b1_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b1_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b2_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b2_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b2_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b2_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b2_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b2_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b3_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b3_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b3_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b3_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b3_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b3_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b4_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b4_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b4_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b4_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b4_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b4_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b5_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b5_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b5_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b5_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b5_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b5_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b6_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b6_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b6_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b6_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b6_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b6_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn3b7_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "name": "res3b7_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b7_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "res3b7_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 128], "name": "bn3b7_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "name": "res3b7_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4a_branch1/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "name": "res4a_branch1/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b1_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b1_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b1_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b1_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b1_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b1_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b2_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b2_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b2_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b2_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b2_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b2_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b3_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b3_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b3_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b3_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b3_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b3_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b4_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b4_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b4_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b4_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b4_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b4_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b5_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b5_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b5_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b5_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b5_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b5_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b6_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b6_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b6_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b6_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b6_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b6_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b7_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b7_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b7_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b7_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b7_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b7_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b8_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b8_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b8_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b8_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b8_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b8_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b9_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b9_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b9_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b9_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b9_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b9_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b10_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b10_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b10_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b10_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b10_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b10_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b11_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b11_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b11_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b11_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b11_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b11_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b12_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b12_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b12_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b12_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b12_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b12_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b13_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b13_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b13_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b13_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b13_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b13_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b14_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b14_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b14_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b14_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b14_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b14_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b15_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b15_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b15_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b15_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b15_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b15_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b16_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b16_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b16_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b16_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b16_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b16_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b17_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b17_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b17_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b17_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b17_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b17_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b18_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b18_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b18_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b18_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b18_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b18_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b19_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b19_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b19_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b19_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b19_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b19_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b20_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b20_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b20_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b20_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b20_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b20_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b21_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b21_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b21_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b21_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b21_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b21_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b22_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b22_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b22_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b22_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b22_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b22_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b23_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b23_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b23_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b23_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b23_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b23_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b24_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b24_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b24_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b24_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b24_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b24_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b25_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b25_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b25_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b25_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b25_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b25_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b26_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b26_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b26_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b26_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b26_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b26_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b27_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b27_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b27_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b27_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b27_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b27_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b28_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b28_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b28_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b28_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b28_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b28_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b29_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b29_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b29_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b29_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b29_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b29_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b30_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b30_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b30_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b30_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b30_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b30_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b31_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b31_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b31_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b31_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b31_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b31_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b32_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b32_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b32_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b32_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b32_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b32_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b33_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b33_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b33_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b33_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b33_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b33_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b34_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b34_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b34_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b34_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b34_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b34_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 1024], "name": "bn4b35_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "name": "res4b35_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b35_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "res4b35_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 256], "name": "bn4b35_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 256], "name": "res4b35_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 2048], "name": "bn5a_branch1/sub"}, {"dtype": "float32", "shape": [1, 1, 1024, 2048], "name": "res5a_branch1/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 2048], "name": "bn5b_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5b_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5b_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5b_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5b_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5b_branch2a/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 2048], "name": "bn5c_branch2c/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 2048], "name": "res5c_branch2c/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5c_branch2b/sub"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "res5c_branch2b/merged_input"}, {"dtype": "float32", "shape": [1, 1, 1, 512], "name": "bn5c_branch2a/sub"}, {"dtype": "float32", "shape": [1, 1, 2048, 512], "name": "res5c_branch2a/merged_input"}]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "365"}]}}}}, "name": "dense/bias", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}, {"size": "365"}]}}}}, "name": "dense/kernel", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "name": "Flatten/flatten/Reshape/shape/1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "Flatten/flatten/strided_slice/stack_1", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}, "name": "Flatten/flatten/strided_slice/stack", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "2048"}]}}}}, "name": "bn5a_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "2048"}]}}}}, "name": "res5a_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn5a_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}}, "name": "res5a_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "Pad_1/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn5a_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1024"}, {"size": "512"}]}}}}, "name": "res5a_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1024"}]}}}}, "name": "bn4a_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "res4a_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn4a_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}, "name": "res4a_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn4a_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}}, "name": "res4a_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3a_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3a_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3a_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3a_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3a_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}}, "name": "res3a_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn2a_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "res2a_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2a_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "res2a_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2a_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "res2a_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "name": "PadV2/constant_values", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "PadV2/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn_conv1/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}}, "name": "conv1/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}, "name": "Pad/paddings", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "name": "data", "op": "Placeholder"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn2a_branch1/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "res2a_branch1/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn2b_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "res2b_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2b_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "res2b_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2b_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}, "name": "res2b_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn2c_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "256"}]}}}}, "name": "res2c_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2c_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}, "name": "res2c_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}}, "name": "bn2c_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "64"}]}}}}, "name": "res2c_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3a_branch1/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "512"}]}}}}, "name": "res3a_branch1/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b1_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b1_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b1_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b1_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b1_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b1_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b2_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b2_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b2_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b2_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b2_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b2_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b3_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b3_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b3_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b3_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b3_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b3_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b4_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b4_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b4_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b4_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b4_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b4_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b5_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b5_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b5_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b5_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b5_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b5_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b6_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b6_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b6_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b6_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b6_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b6_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "512"}]}}}}, "name": "bn3b7_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "512"}]}}}}, "name": "res3b7_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b7_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}, "name": "res3b7_branch2b/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}, "name": "bn3b7_branch2a/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "128"}]}}}}, "name": "res3b7_branch2a/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1024"}]}}}}, "name": "bn4a_branch1/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1024"}]}}}}, "name": "res4a_branch1/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1024"}]}}}}, "name": "bn4b1_branch2c/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "1024"}]}}}}, "name": "res4b1_branch2c/merged_input", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "256"}]}}}}, "name": "bn4b1_branch2b/sub", "op": "Const"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": 